# Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Initial Data Exploration

In [2]:
# Loading the dataset
df = pd.read_csv('Salary_Dataset_with_Extra_Features.csv')

In [3]:
df.shape

(22770, 8)

In [4]:
df.head(3)

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22770 entries, 0 to 22769
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rating             22770 non-null  float64
 1   Company Name       22769 non-null  object
 2   Job Title          22770 non-null  object
 3   Salary             22770 non-null  int64
 4   Salaries Reported  22770 non-null  int64
 5   Location           22770 non-null  object
 6   Employment Status  22770 non-null  object
 7   Job Roles          22770 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 1.4+ MB

In [6]:
df['Salary'].describe

<bound method NDFrame.describe of 0         400000
1         400000
2        1000000
3         300000
4         600000
          ...
22765     200000
22766     300000
22767     192000
22768     300000
22769     300000
Name: Salary, Length: 22770, dtype: int64>

In [7]:
df.describe()

             Rating        Salary  Salaries Reported
count  22770.000000  2.277000e+04       22770.000000
mean       3.918213  6.953872e+05           1.855775
std        0.519675  8.843990e+05           6.823668
min        1.000000  2.112000e+03           1.000000
25%        3.700000  3.000000e+05           1.000000
50%        3.900000  5.000000e+05           1.000000
75%        4.200000  9.000000e+05           1.000000
max        5.000000  9.000000e+07         361.000000

## Data cleaning
After reviewing the dataset, the only issue was the NaN value somewhere for the company name, so I will clean it up.
As for data types, all of them are valid so there is no need to do anything else.

In [8]:
# Removing the NaN value since there is one missing company name
df = df.dropna()
# Checking if everything is okay
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 22769 entries, 0 to 22769
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rating             22769 non-null  float64
 1   Company Name       22769 non-null  object
 2   Job Title          22769 non-null  object
 3   Salary             22769 non-null  int64
 4   Salaries Reported  22769 non-null  int64
 5   Location           22769 non-null  object
 6   Employment Status  22769 non-null  object
 7   Job Roles          22769 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 1.6+ MB

# Exploratory Data Analysis (EDA)

In this section, I will explore the dataset to identify trends, distributions, and possible relationships between variables such as Salary, Job Title, Location, and Company Rating.

### What is the distribution for salaries in the whole dataset?
I will plot a histogram to see how are salaries distributed on the whole data set.

In [ ]:
fig = plt.figure(figsize = (10,7))

ax1 = fig.add_axes([0,0,1,1])